#include <stdio.h>
#include "backend.h"
#include "render.h"
#include "teapot.h"

void print_fbdata();
/*
UV_t uvs[36] = {
    // --- ПЕРЕДНЯЯ ГРАНЬ (Z = -0.5) ---
    {0.0, 1.0}, {1.0, 0.0}, {1.0, 1.0}, // Треугольник 1
    {0.0, 1.0}, {0.0, 0.0}, {1.0, 0.0}, // Треугольник 2

    // --- ЗАДНЯЯ ГРАНЬ (Z = 0.5) ---
    {1.0, 1.0}, {0.0, 1.0}, {0.0, 0.0}, // Треугольник 3
    {1.0, 1.0}, {0.0, 0.0}, {1.0, 0.0}, // Треугольник 4

    // --- ЛЕВАЯ ГРАНЬ (X = -0.5) ---
    {0.0, 1.0}, {1.0, 0.0}, {1.0, 1.0}, // Треугольник 5
    {0.0, 1.0}, {0.0, 0.0}, {1.0, 0.0}, // Треугольник 6

    // --- ПРАВАЯ ГРАНЬ (X = 0.5) ---
    {0.0, 1.0}, {1.0, 0.0}, {1.0, 1.0}, // Треугольник 7
    {0.0, 1.0}, {0.0, 0.0}, {1.0, 0.0}, // Треугольник 8

    // --- ВЕРХНЯЯ ГРАНЬ (Y = 0.5) ---
    {0.0, 1.0}, {1.0, 0.0}, {1.0, 1.0}, // Треугольник 9
    {0.0, 1.0}, {0.0, 0.0}, {1.0, 0.0}, // Треугольник 10

    // --- НИЖНЯЯ ГРАНЬ (Y = -0.5) ---
    {0.0, 0.0}, {1.0, 0.0}, {1.0, 1.0}, // Треугольник 11
    {0.0, 0.0}, {1.0, 1.0}, {0.0, 1.0}  // Треугольник 12
};

// Полный куб из 12 треугольников (36 вершин)
Vector3_t vertices[36] = {
    // --- ПЕРЕДНЯЯ ГРАНЬ (Z = -0.5) ---
    {-0.5, -0.5, -0.5}, { 0.5,  0.5, -0.5}, { 0.5, -0.5, -0.5}, // Треугольник 1
    {-0.5, -0.5, -0.5}, {-0.5,  0.5, -0.5}, { 0.5,  0.5, -0.5}, // Треугольник 2

    // --- ЗАДНЯЯ ГРАНЬ (Z = 0.5) ---
    {-0.5, -0.5,  0.5}, { 0.5, -0.5,  0.5}, { 0.5,  0.5,  0.5}, // Треугольник 3
    {-0.5, -0.5,  0.5}, { 0.5,  0.5,  0.5}, {-0.5,  0.5,  0.5}, // Треугольник 4

    // --- ЛЕВАЯ ГРАНЬ (X = -0.5) ---
    {-0.5, -0.5,  0.5}, {-0.5,  0.5, -0.5}, {-0.5, -0.5, -0.5}, // Треугольник 5
    {-0.5, -0.5,  0.5}, {-0.5,  0.5,  0.5}, {-0.5,  0.5, -0.5}, // Треугольник 6

    // --- ПРАВАЯ ГРАНЬ (X = 0.5) ---
    { 0.5, -0.5, -0.5}, { 0.5,  0.5,  0.5}, { 0.5, -0.5,  0.5}, // Треугольник 7
    { 0.5, -0.5, -0.5}, { 0.5,  0.5, -0.5}, { 0.5,  0.5,  0.5}, // Треугольник 8

    // --- ВЕРХНЯЯ ГРАНЬ (Y = 0.5) ---
    {-0.5,  0.5, -0.5}, { 0.5,  0.5,  0.5}, { 0.5,  0.5, -0.5}, // Треугольник 9
    {-0.5,  0.5, -0.5}, {-0.5,  0.5,  0.5}, { 0.5,  0.5,  0.5}, // Треугольник 10

    // --- НИЖНЯЯ ГРАНЬ (Y = -0.5) ---
    {-0.5, -0.5, -0.5}, { 0.5, -0.5, -0.5}, { 0.5, -0.5,  0.5}, // Треугольник 11
    {-0.5, -0.5, -0.5}, { 0.5, -0.5,  0.5}, {-0.5, -0.5,  0.5}  // Треугольник 12
};
*/
int main() {
	const Vector3_t ZEROVEC = {0,0,0};
	const Vector3_t POSCAM = {0,2,-5};
	Vector3_t world_vertices[7000];
	obj2world(polys, 6768, vertices, world_vertices);


	Render_frame(world_vertices, 6768, NULL, POSCAM, ZEROVEC);
	print_fbdata();
}
